index.org
#+title: Library for Atcoder
#+author: takeounn
#+email: bararararatty@gmail.com
#+startup: content
#+startup: nohideblocks
#+options: num:t auto-id:t
#+setupfile: theme-readtheorg.setup
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

* anaphoric macros
** aif
*** definition
    #+NAME: aif
    #+BEGIN_SRC lisp
      (defmacro aif (test-form then-form &optional else-form)
        `(let ((it ,test-form))
           (if it ,then-form ,else-form)))
    #+END_SRC
*** usage
   #+BEGIN_SRC lisp
     (aif 11 (princ it)) ;; => 11
   #+END_SRC
** awhen
*** definition
    #+name:awhen
    #+BEGIN_SRC lisp :noweb yes
      <<aif>>

      (defmacro awhen (test-form &body body)
        `(aif ,test-form
              (progn ,@body)))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (awhen 10 (print it)) ;; => 10
    #+END_SRC
** aand
*** definition
    #+name: aand
    #+BEGIN_SRC lisp :noweb yes
      (defmacro aand (&rest args)
        (cond ((null args) t)
              ((null (cdr args)) (car args))
              (t `(aif ,(car args) (aand ,@(cdr args))))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** acond
*** definition
    #+name:acond
    #+BEGIN_SRC lisp :noweb yes
      (defmacro acond (&rest clauses)
        (if (null clauses)
            nil
            (let ((cl1 (car clauses))
                  (sym (gensym)))
              `(let ((,sym ,(car cl1)))
                 (if ,sym
                     (let ((it ,sym)) ,@(cdr cl1))
                     (acond ,@(cdr clauses)))))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** alambda
*** definition
    #+name: alambda
    #+BEGIN_SRC lisp :noweb yes
      (defmacro alambda (parms &body body)
        `(labels ((self ,parms ,@body))
           #'self))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** ablock
*** definition
    #+name: ablock
    #+BEGIN_SRC lisp :noweb yes
      <<alambda>>

      (defmacro ablock (tag &rest args)
        `(block ,tag
           ,(funcall (alambda (args)
                              (case (length args)
                                (0 nil)
                                (1 (car args))
                                (t `(let ((it ,(car args)))
                                      ,(self (cdr args))))))
                     args)))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
    #+END_SRC
** amap
*** definition
    #+name: amap
    #+BEGIN_SRC lisp :noweb yes
      (defmacro alambda (parms &body body)
        `(labels ((self ,parms ,@body))
           #'self))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** aevery
