index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-07 Sat 01:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Library for Atcoder</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="takeounn" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Library for Atcoder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org43a4a6c">1. anaphoric macros</a>
<ul>
<li><a href="#orgc357a00">1.1. aif</a>
<ul>
<li><a href="#org6237a8a">1.1.1. definition</a></li>
<li><a href="#orgb5b8074">1.1.2. usage</a></li>
</ul>
</li>
<li><a href="#org996f7ee">1.2. awhen</a>
<ul>
<li><a href="#org1e8b1e8">1.2.1. definition</a></li>
<li><a href="#org86ff131">1.2.2. usage</a></li>
</ul>
</li>
<li><a href="#org61e6c15">1.3. aand</a>
<ul>
<li><a href="#org2dfc1c2">1.3.1. definition</a></li>
<li><a href="#org65507f2">1.3.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org3609d39">1.4. acond</a>
<ul>
<li><a href="#org39eaa1a">1.4.1. definition</a></li>
<li><a href="#org18c6f54">1.4.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org0bc3351">1.5. alambda</a>
<ul>
<li><a href="#org623a657">1.5.1. definition</a></li>
<li><a href="#orgaa3f980">1.5.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orgce7ab26">1.6. ablock</a>
<ul>
<li><a href="#org850be4a">1.6.1. definition</a></li>
<li><a href="#orgda67108">1.6.2. usage</a></li>
</ul>
</li>
<li><a href="#orgbe35808">1.7. amap</a>
<ul>
<li><a href="#orgac33902">1.7.1. definition</a></li>
<li><a href="#orgb8d07ff">1.7.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orgd2c1f16">1.8. aevery</a>
<ul>
<li><a href="#orga64c0a8">1.8.1. definition</a></li>
<li><a href="#org1c35d9c">1.8.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orgd41f1b5">1.9. areduce</a>
<ul>
<li><a href="#org4abcb9a">1.9.1. definition</a></li>
<li><a href="#orgd5a11a4">1.9.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgec73dbe">2. string</a>
<ul>
<li><a href="#org3d64826">2.1. string+</a>
<ul>
<li><a href="#org3f76adb">2.1.1. definition</a></li>
<li><a href="#orgf2ac3eb">2.1.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orgb8c7060">2.2. every-string=</a>
<ul>
<li><a href="#org1aad49d">2.2.1. definition</a></li>
<li><a href="#orgfe658c5">2.2.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde2e8b5">3. char</a>
<ul>
<li><a href="#orge19ea81">3.1. char+</a>
<ul>
<li><a href="#org73ae460">3.1.1. definition</a></li>
<li><a href="#orgd70a56b">3.1.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org0a467bf">3.2. char-code+</a>
<ul>
<li><a href="#org7b802ae">3.2.1. definition</a></li>
<li><a href="#orgc692534">3.2.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org722941c">4. awesome</a>
<ul>
<li><a href="#orgafc4222">4.1. nested-loops</a>
<ul>
<li><a href="#org5bc4edc">4.1.1. definition</a></li>
<li><a href="#org25ce4c2">4.1.2. usage</a></li>
</ul>
</li>
<li><a href="#org849a85d">4.2. nested-nth</a>
<ul>
<li><a href="#org6aefc52">4.2.1. definition</a></li>
<li><a href="#org91be895">4.2.2. usage</a></li>
</ul>
</li>
<li><a href="#orgbcbdf0b">4.3. get-even-list</a>
<ul>
<li><a href="#orgdbdebf9">4.3.1. definition</a></li>
<li><a href="#orga8e4580">4.3.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orga227ef7">4.4. remove-nth</a>
<ul>
<li><a href="#org8ff95c7">4.4.1. definition</a></li>
<li><a href="#orgce1ff8c">4.4.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org3930d06">4.5. check-bit-frag</a>
<ul>
<li><a href="#org9e67f5f">4.5.1. definition</a></li>
<li><a href="#org6f3f75e">4.5.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org06279db">4.6. binary-search</a>
<ul>
<li><a href="#orgc5a9323">4.6.1. definition</a></li>
<li><a href="#org93e5183">4.6.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org236ca49">4.7. convert-sum-list</a>
<ul>
<li><a href="#org60f36b4">4.7.1. definition</a></li>
<li><a href="#org8a34328">4.7.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#org2532eaf">4.8. while</a>
<ul>
<li><a href="#org0ae5861">4.8.1. definition</a></li>
<li><a href="#org6030a01">4.8.2. <span class="todo TODO">TODO</span> usage</a></li>
</ul>
</li>
<li><a href="#orgcbb45f9">4.9. 等差数列の和</a>
<ul>
<li><a href="#org6e74ec3">4.9.1. definition</a></li>
<li><a href="#orgb37722e">4.9.2. usage</a></li>
</ul>
</li>
<li><a href="#orga670c7d">4.10. マンハッタン距離</a>
<ul>
<li><a href="#orgf2075d2">4.10.1. definition</a></li>
<li><a href="#org4d3c1f1">4.10.2. usage</a></li>
</ul>
</li>
<li><a href="#org28bbd03">4.11. ユークリッド距離</a>
<ul>
<li><a href="#orgf478273">4.11.1. definition</a></li>
<li><a href="#org5b525b9">4.11.2. usage</a></li>
</ul>
</li>
<li><a href="#org64fcaba">4.12. チェビシェフ距離</a>
<ul>
<li><a href="#orgabb49de">4.12.1. definition</a></li>
<li><a href="#orgf506cbf">4.12.2. usage</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org43a4a6c" class="outline-2">
<h2 id="org43a4a6c"><span class="section-number-2">1</span> anaphoric macros</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc357a00" class="outline-3">
<h3 id="orgc357a00"><span class="section-number-3">1.1</span> aif</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6237a8a" class="outline-4">
<h4 id="org6237a8a"><span class="section-number-4">1.1.1</span> definition</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org5602d77">(<span class="org-keyword">defmacro</span> <span class="org-function-name">aif</span> (test-form then-form <span class="org-type">&amp;optional</span> else-form)
  `(<span class="org-keyword">let</span> ((it ,test-form))
     (<span class="org-keyword">if</span> it ,then-form ,else-form)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5b8074" class="outline-4">
<h4 id="orgb5b8074"><span class="section-number-4">1.1.2</span> usage</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-lisp">(aif 11 (princ it)) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 11</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org996f7ee" class="outline-3">
<h3 id="org996f7ee"><span class="section-number-3">1.2</span> awhen</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org1e8b1e8" class="outline-4">
<h4 id="org1e8b1e8"><span class="section-number-4">1.2.1</span> definition</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orgf0a9dde">(<span class="org-keyword">defmacro</span> <span class="org-function-name">aif</span> (test-form then-form <span class="org-type">&amp;optional</span> else-form)
  `(<span class="org-keyword">let</span> ((it ,test-form))
     (<span class="org-keyword">if</span> it ,then-form ,else-form)))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">awhen</span> (test-form <span class="org-type">&amp;body</span> body)
  `(aif ,test-form
        (<span class="org-keyword">progn</span> ,@body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org86ff131" class="outline-4">
<h4 id="org86ff131"><span class="section-number-4">1.2.2</span> usage</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-lisp">(awhen 10 (print it)) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 10</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org61e6c15" class="outline-3">
<h3 id="org61e6c15"><span class="section-number-3">1.3</span> aand</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2dfc1c2" class="outline-4">
<h4 id="org2dfc1c2"><span class="section-number-4">1.3.1</span> definition</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orge012295">(<span class="org-keyword">defmacro</span> <span class="org-function-name">aand</span> (<span class="org-type">&amp;rest</span> args)
  (<span class="org-keyword">cond</span> ((null args) t)
        ((null (cdr args)) (car args))
        (t `(aif ,(car args) (aand ,@(cdr args))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org65507f2" class="outline-4">
<h4 id="org65507f2"><span class="section-number-4">1.3.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3609d39" class="outline-3">
<h3 id="org3609d39"><span class="section-number-3">1.4</span> acond</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org39eaa1a" class="outline-4">
<h4 id="org39eaa1a"><span class="section-number-4">1.4.1</span> definition</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org352ba03">(<span class="org-keyword">defmacro</span> <span class="org-function-name">acond</span> (<span class="org-type">&amp;rest</span> clauses)
  (<span class="org-keyword">if</span> (null clauses)
      nil
      (<span class="org-keyword">let</span> ((cl1 (car clauses))
            (sym (gensym)))
        `(<span class="org-keyword">let</span> ((,sym ,(car cl1)))
           (<span class="org-keyword">if</span> ,sym
               (<span class="org-keyword">let</span> ((it ,sym)) ,@(cdr cl1))
               (acond ,@(cdr clauses)))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org18c6f54" class="outline-4">
<h4 id="org18c6f54"><span class="section-number-4">1.4.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0bc3351" class="outline-3">
<h3 id="org0bc3351"><span class="section-number-3">1.5</span> alambda</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org623a657" class="outline-4">
<h4 id="org623a657"><span class="section-number-4">1.5.1</span> definition</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orgf30073b">(<span class="org-keyword">defmacro</span> <span class="org-function-name">alambda</span> (parms <span class="org-type">&amp;body</span> body)
  `(<span class="org-keyword">labels</span> ((self ,parms ,@body))
     #'self))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa3f980" class="outline-4">
<h4 id="orgaa3f980"><span class="section-number-4">1.5.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgce7ab26" class="outline-3">
<h3 id="orgce7ab26"><span class="section-number-3">1.6</span> ablock</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org850be4a" class="outline-4">
<h4 id="org850be4a"><span class="section-number-4">1.6.1</span> definition</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orge158e57">(<span class="org-keyword">defmacro</span> <span class="org-function-name">alambda</span> (parms <span class="org-type">&amp;body</span> body)
  `(<span class="org-keyword">labels</span> ((self ,parms ,@body))
     #'self))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">ablock</span> (tag <span class="org-type">&amp;rest</span> args)
  `(<span class="org-keyword">block</span> ,tag
     ,(funcall (alambda (args)
                        (<span class="org-keyword">case</span> (length args)
                          (0 nil)
                          (1 (car args))
                          (t `(<span class="org-keyword">let</span> ((it ,(car args)))
                                ,(self (cdr args))))))
               args)))
</pre>
</div>
</div>
</div>
