index.org
*** definition
    #+name: aevery
    #+BEGIN_SRC lisp :noweb yes
      (defmacro aevery (form list)
        `(every #'(lambda (it) ,form) ,list))

    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** areduce
*** definition
    #+name: areduce
    #+BEGIN_SRC lisp :noweb yes
      (defmacro areduce (form list &key initial-value)
        `(reduce #'(lambda (it-accum it) ,form) ,list :initial-value ,initial-value))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
* string
** string+
*** definition
    #+name: string+
    #+BEGIN_SRC lisp :noweb yes
      (defmacro string+ (&rest str)
        `(concatenate 'string ,@str))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** every-string=
*** definition
    #+name: every-string=
    #+BEGIN_SRC lisp :noweb yes
      (defmacro every-string= (c sequence)
        `(aevery (string= it ,c) ,sequence))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
* char
** char+
*** definition
    #+name: char+
    #+BEGIN_SRC lisp :noweb yes
      (defmacro char-1+ (char)
        `(code-char (1+ (char-code ,char))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** char-code+
*** definition
    #+name: char-code+
    #+BEGIN_SRC lisp :noweb yes
      (defmacro char-code+ (char num)
        `(code-char (+ (char-code ,char) ,num)))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
* awesome
** nested-loops
*** definition
    #+name: nested-loops
    #+BEGIN_SRC lisp :noweb yes
      (defmacro nested-loops (vars values &rest body)
        (if vars
            `(loop :for ,(first vars) :from ,(car (first values)) :to ,(cdr (first values))
                   :do (nested-loops ,(rest vars) ,(rest values) ,@body))
            `(progn ,@body)))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (nested-loops (x y) ((1 . 2) (1 . 2))
                    (princ (* x y)))
    #+END_SRC
** nested-nth
*** definition
    #+name: nested-nth
    #+BEGIN_SRC lisp :noweb yes
      (defmacro nested-nth (idxs my-lst)
        `(if ,idxs (nth (car (reverse ,idxs)) (nested-nth (cdr (reverse ,idxs)) ,my-lst)) ,my-lst))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (nested-nth '(1 1) '(1 (1 2)))
    #+END_SRC
** get-even-list
*** definition
    #+name: get-even-list
    #+BEGIN_SRC lisp :noweb yes
      (defun get-even-list (lst)
        (loop :with return-lst = '()
              :for index :from 0 :below (length lst)
              :unless (zerop (mod index 2))
                :do (setf return-lst (append return-lst (list (nth index lst))))
              :finally (return return-lst)))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** remove-nth
*** definition
    #+name: remove-nth
    #+BEGIN_SRC lisp :noweb yes
      (defun remove-nth (n list)
        (declare
          (type (integer 0) n)
          (type list list))
        (if (or (zerop n) (null list))
          (cdr list)
          (cons (car list) (remove-nth (1- n) (cdr list)))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** check-bit-frag
