index.html
<div id="outline-container-orgda67108" class="outline-4">
<h4 id="orgda67108"><span class="section-number-4">1.6.2</span> usage</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbe35808" class="outline-3">
<h3 id="orgbe35808"><span class="section-number-3">1.7</span> amap</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgac33902" class="outline-4">
<h4 id="orgac33902"><span class="section-number-4">1.7.1</span> definition</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orgdaf6440">(<span class="org-keyword">defmacro</span> <span class="org-function-name">alambda</span> (parms <span class="org-type">&amp;body</span> body)
  `(<span class="org-keyword">labels</span> ((self ,parms ,@body))
     #'self))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8d07ff" class="outline-4">
<h4 id="orgb8d07ff"><span class="section-number-4">1.7.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd2c1f16" class="outline-3">
<h3 id="orgd2c1f16"><span class="section-number-3">1.8</span> aevery</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-orga64c0a8" class="outline-4">
<h4 id="orga64c0a8"><span class="section-number-4">1.8.1</span> definition</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org7a78cdd">(<span class="org-keyword">defmacro</span> <span class="org-function-name">aevery</span> (form list)
  `(every #'(<span class="org-keyword">lambda</span> (it) ,form) ,list))

</pre>
</div>
</div>
</div>
<div id="outline-container-org1c35d9c" class="outline-4">
<h4 id="org1c35d9c"><span class="section-number-4">1.8.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-8-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd41f1b5" class="outline-3">
<h3 id="orgd41f1b5"><span class="section-number-3">1.9</span> areduce</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-org4abcb9a" class="outline-4">
<h4 id="org4abcb9a"><span class="section-number-4">1.9.1</span> definition</h4>
<div class="outline-text-4" id="text-1-9-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org706e114">(<span class="org-keyword">defmacro</span> <span class="org-function-name">areduce</span> (form list <span class="org-type">&amp;key</span> initial-value)
  `(reduce #'(<span class="org-keyword">lambda</span> (it-accum it) ,form) ,list <span class="org-builtin">:initial-value</span> ,initial-value))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd5a11a4" class="outline-4">
<h4 id="orgd5a11a4"><span class="section-number-4">1.9.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-1-9-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgec73dbe" class="outline-2">
<h2 id="orgec73dbe"><span class="section-number-2">2</span> string</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3d64826" class="outline-3">
<h3 id="org3d64826"><span class="section-number-3">2.1</span> string+</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org3f76adb" class="outline-4">
<h4 id="org3f76adb"><span class="section-number-4">2.1.1</span> definition</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org954c9a8">(<span class="org-keyword">defmacro</span> <span class="org-function-name">string+</span> (<span class="org-type">&amp;rest</span> str)
  `(concatenate 'string ,@str))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2ac3eb" class="outline-4">
<h4 id="orgf2ac3eb"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb8c7060" class="outline-3">
<h3 id="orgb8c7060"><span class="section-number-3">2.2</span> every-string=</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org1aad49d" class="outline-4">
<h4 id="org1aad49d"><span class="section-number-4">2.2.1</span> definition</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org8e46a06">(<span class="org-keyword">defmacro</span> <span class="org-function-name">every-string=</span> (c sequence)
  `(aevery (string= it ,c) ,sequence))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe658c5" class="outline-4">
<h4 id="orgfe658c5"><span class="section-number-4">2.2.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgde2e8b5" class="outline-2">
<h2 id="orgde2e8b5"><span class="section-number-2">3</span> char</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge19ea81" class="outline-3">
<h3 id="orge19ea81"><span class="section-number-3">3.1</span> char+</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org73ae460" class="outline-4">
<h4 id="org73ae460"><span class="section-number-4">3.1.1</span> definition</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org2bff22b">(<span class="org-keyword">defmacro</span> <span class="org-function-name">char-1+</span> (char)
  `(code-char (1+ (char-code ,char))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd70a56b" class="outline-4">
<h4 id="orgd70a56b"><span class="section-number-4">3.1.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0a467bf" class="outline-3">
<h3 id="org0a467bf"><span class="section-number-3">3.2</span> char-code+</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7b802ae" class="outline-4">
<h4 id="org7b802ae"><span class="section-number-4">3.2.1</span> definition</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org5d3ece7">(<span class="org-keyword">defmacro</span> <span class="org-function-name">char-code+</span> (char num)
  `(code-char (+ (char-code ,char) ,num)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc692534" class="outline-4">
<h4 id="orgc692534"><span class="section-number-4">3.2.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org722941c" class="outline-2">
<h2 id="org722941c"><span class="section-number-2">4</span> awesome</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgafc4222" class="outline-3">
<h3 id="orgafc4222"><span class="section-number-3">4.1</span> nested-loops</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org5bc4edc" class="outline-4">
<h4 id="org5bc4edc"><span class="section-number-4">4.1.1</span> definition</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org2904a7d">(<span class="org-keyword">defmacro</span> <span class="org-function-name">nested-loops</span> (vars values <span class="org-type">&amp;rest</span> body)
  (<span class="org-keyword">if</span> vars
      `(<span class="org-keyword">loop</span> <span class="org-builtin">:for</span> ,(first vars) <span class="org-builtin">:from</span> ,(car (first values)) <span class="org-builtin">:to</span> ,(cdr (first values))
             <span class="org-builtin">:do</span> (nested-loops ,(rest vars) ,(rest values) ,@body))
      `(<span class="org-keyword">progn</span> ,@body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org25ce4c2" class="outline-4">
<h4 id="org25ce4c2"><span class="section-number-4">4.1.2</span> usage</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-lisp">(nested-loops (x y) ((1 . 2) (1 . 2))
              (princ (* x y)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org849a85d" class="outline-3">
<h3 id="org849a85d"><span class="section-number-3">4.2</span> nested-nth</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org6aefc52" class="outline-4">
<h4 id="org6aefc52"><span class="section-number-4">4.2.1</span> definition</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org9eb68ca">(<span class="org-keyword">defmacro</span> <span class="org-function-name">nested-nth</span> (idxs my-lst)
  `(<span class="org-keyword">if</span> ,idxs (nth (car (reverse ,idxs)) (nested-nth (cdr (reverse ,idxs)) ,my-lst)) ,my-lst))
</pre>
</div>
</div>
</div>
<div id="outline-container-org91be895" class="outline-4">
<h4 id="org91be895"><span class="section-number-4">4.2.2</span> usage</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-lisp">(nested-nth '(1 1) '(1 (1 2)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbcbdf0b" class="outline-3">
<h3 id="orgbcbdf0b"><span class="section-number-3">4.3</span> get-even-list</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgdbdebf9" class="outline-4">
<h4 id="orgdbdebf9"><span class="section-number-4">4.3.1</span> definition</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org7b9f2d9">(<span class="org-keyword">defun</span> <span class="org-function-name">get-even-list</span> (lst)
  (<span class="org-keyword">loop</span> <span class="org-builtin">:with</span> return-lst = '()
        <span class="org-builtin">:for</span> index <span class="org-builtin">:from</span> 0 <span class="org-builtin">:below</span> (length lst)
        <span class="org-builtin">:unless</span> (zerop (mod index 2))
          <span class="org-builtin">:do</span> (setf return-lst (append return-lst (list (nth index lst))))
        <span class="org-builtin">:finally</span> (<span class="org-keyword">return</span> return-lst)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga8e4580" class="outline-4">
<h4 id="orga8e4580"><span class="section-number-4">4.3.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga227ef7" class="outline-3">
<h3 id="orga227ef7"><span class="section-number-3">4.4</span> remove-nth</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org8ff95c7" class="outline-4">
<h4 id="org8ff95c7"><span class="section-number-4">4.4.1</span> definition</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org454aa65">(<span class="org-keyword">defun</span> <span class="org-function-name">remove-nth</span> (n list)
  (<span class="org-keyword">declare</span>
    (type (integer 0) n)
    (type list list))
  (<span class="org-keyword">if</span> (or (zerop n) (null list))
    (cdr list)
    (cons (car list) (remove-nth (1- n) (cdr list)))))
</pre>
</div>
</div>
</div>
