index.org
*** definition
    #+name: check-bit-frag
    #+BEGIN_SRC lisp :noweb yes
      (defun check-bit-frag (bit index)
        (logand (ash bit (- 0 index)) 1))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** binary-search
*** definition
    #+name: binary-search
    #+BEGIN_SRC lisp :noweb yes
      (defun binary-search (item buffer)
        (do ((low 0)
             (high (1- (length buffer))))
            ((> low high))
          (let ((mid (floor (+ low high) 2)))
            (cond
              ((= (nth mid buffer) item) (return mid))
              ((< (nth mid buffer) item) (setq low (1+ mid)))
              (t (setq high (1- mid)))))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** convert-sum-list
*** definition
    #+name: convert-sum-list
    #+BEGIN_SRC lisp :noweb yes
      (defun convert-sum-list (lst)
        (cdr (reduce #'(lambda (accum elm)
                         (append accum (list (+ (car (last accum)) elm))))
                     lst
                     :initial-value '(0))))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** while
*** definition
    #+name: while
    #+BEGIN_SRC lisp :noweb yes
      (defmacro while (test &body body)
        `(do ()
           ((not ,test))
           ,@body))
    #+END_SRC
*** TODO usage
    #+BEGIN_SRC lisp
    #+END_SRC
** 等差数列の和
*** definition
    #+name: arithmetic-progression-sum
    #+BEGIN_SRC lisp :noweb yes
      (defun arithmetic-progression-sum (a b)
        (let ((n (1+ (- b a))))
          (+ (* n (1- a))
             (/ (* n (1+ n)) 2))))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (arithmetic-progression-sum 2 8) ;; => 35
    #+END_SRC
** マンハッタン距離
*** definition
    #+name: manhattan-distance
    #+BEGIN_SRC lisp :noweb yes
      (defun manhattan-distance (lst)
        (reduce #'+ (mapcar #'abs lst)))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (manhattan-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) ;; => 39
    #+END_SRC
** ユークリッド距離
*** definition
    #+name: euclidean-distance
    #+BEGIN_SRC lisp :noweb yes
      (defun euclidean-distance (lst)
        (sqrt (reduce #'+ (mapcar #'(lambda (x) (coerce (* x x) 'double-float)) lst))))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (euclidean-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) ;; => 14.387494569938159
    #+END_SRC
** チェビシェフ距離
*** definition
    #+name: chebyshev-distance
    #+BEGIN_SRC lisp :noweb yes
      (defun chebyshev-distance (lst)
        (reduce #'max (mapcar #'abs lst)))
    #+END_SRC
*** usage
    #+BEGIN_SRC lisp
      (chebyshev-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) ;; => 9
    #+END_SRC
