index.html
<div id="outline-container-orgce1ff8c" class="outline-4">
<h4 id="orgce1ff8c"><span class="section-number-4">4.4.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3930d06" class="outline-3">
<h3 id="org3930d06"><span class="section-number-3">4.5</span> check-bit-frag</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org9e67f5f" class="outline-4">
<h4 id="org9e67f5f"><span class="section-number-4">4.5.1</span> definition</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org10cb441">(<span class="org-keyword">defun</span> <span class="org-function-name">check-bit-frag</span> (bit index)
  (logand (ash bit (- 0 index)) 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f3f75e" class="outline-4">
<h4 id="org6f3f75e"><span class="section-number-4">4.5.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-5-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org06279db" class="outline-3">
<h3 id="org06279db"><span class="section-number-3">4.6</span> binary-search</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-orgc5a9323" class="outline-4">
<h4 id="orgc5a9323"><span class="section-number-4">4.6.1</span> definition</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org36e732c">(<span class="org-keyword">defun</span> <span class="org-function-name">binary-search</span> (item buffer)
  (<span class="org-keyword">do</span> ((low 0)
       (high (1- (length buffer))))
      ((&gt; low high))
    (<span class="org-keyword">let</span> ((mid (floor (+ low high) 2)))
      (<span class="org-keyword">cond</span>
        ((= (nth mid buffer) item) (<span class="org-keyword">return</span> mid))
        ((&lt; (nth mid buffer) item) (setq low (1+ mid)))
        (t (setq high (1- mid)))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org93e5183" class="outline-4">
<h4 id="org93e5183"><span class="section-number-4">4.6.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org236ca49" class="outline-3">
<h3 id="org236ca49"><span class="section-number-3">4.7</span> convert-sum-list</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-org60f36b4" class="outline-4">
<h4 id="org60f36b4"><span class="section-number-4">4.7.1</span> definition</h4>
<div class="outline-text-4" id="text-4-7-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org1cec3f2">(<span class="org-keyword">defun</span> <span class="org-function-name">convert-sum-list</span> (lst)
  (cdr (reduce #'(<span class="org-keyword">lambda</span> (accum elm)
                   (append accum (list (+ (car (last accum)) elm))))
               lst
               <span class="org-builtin">:initial-value</span> '(0))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a34328" class="outline-4">
<h4 id="org8a34328"><span class="section-number-4">4.7.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-7-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2532eaf" class="outline-3">
<h3 id="org2532eaf"><span class="section-number-3">4.8</span> while</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-org0ae5861" class="outline-4">
<h4 id="org0ae5861"><span class="section-number-4">4.8.1</span> definition</h4>
<div class="outline-text-4" id="text-4-8-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org826b3f9">(<span class="org-keyword">defmacro</span> <span class="org-function-name">while</span> (test <span class="org-type">&amp;body</span> body)
  `(<span class="org-keyword">do</span> ()
     ((not ,test))
     ,@body))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6030a01" class="outline-4">
<h4 id="org6030a01"><span class="section-number-4">4.8.2</span> <span class="todo TODO">TODO</span> usage</h4>
<div class="outline-text-4" id="text-4-8-2">
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcbb45f9" class="outline-3">
<h3 id="orgcbb45f9"><span class="section-number-3">4.9</span> 等差数列の和</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-org6e74ec3" class="outline-4">
<h4 id="org6e74ec3"><span class="section-number-4">4.9.1</span> definition</h4>
<div class="outline-text-4" id="text-4-9-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org8a6c7ca">(<span class="org-keyword">defun</span> <span class="org-function-name">arithmetic-progression-sum</span> (a b)
  (<span class="org-keyword">let</span> ((n (1+ (- b a))))
    (+ (* n (1- a))
       (/ (* n (1+ n)) 2))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb37722e" class="outline-4">
<h4 id="orgb37722e"><span class="section-number-4">4.9.2</span> usage</h4>
<div class="outline-text-4" id="text-4-9-2">
<div class="org-src-container">
<pre class="src src-lisp">(arithmetic-progression-sum 2 8) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 35</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga670c7d" class="outline-3">
<h3 id="orga670c7d"><span class="section-number-3">4.10</span> マンハッタン距離</h3>
<div class="outline-text-3" id="text-4-10">
</div>
<div id="outline-container-orgf2075d2" class="outline-4">
<h4 id="orgf2075d2"><span class="section-number-4">4.10.1</span> definition</h4>
<div class="outline-text-4" id="text-4-10-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org6d1a01d">(<span class="org-keyword">defun</span> <span class="org-function-name">manhattan-distance</span> (lst)
  (reduce #'+ (mapcar #'abs lst)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d3c1f1" class="outline-4">
<h4 id="org4d3c1f1"><span class="section-number-4">4.10.2</span> usage</h4>
<div class="outline-text-4" id="text-4-10-2">
<div class="org-src-container">
<pre class="src src-lisp">(manhattan-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 39</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org28bbd03" class="outline-3">
<h3 id="org28bbd03"><span class="section-number-3">4.11</span> ユークリッド距離</h3>
<div class="outline-text-3" id="text-4-11">
</div>
<div id="outline-container-orgf478273" class="outline-4">
<h4 id="orgf478273"><span class="section-number-4">4.11.1</span> definition</h4>
<div class="outline-text-4" id="text-4-11-1">
<div class="org-src-container">
<pre class="src src-lisp" id="orgf399df0">(<span class="org-keyword">defun</span> <span class="org-function-name">euclidean-distance</span> (lst)
  (sqrt (reduce #'+ (mapcar #'(<span class="org-keyword">lambda</span> (x) (coerce (* x x) 'double-float)) lst))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b525b9" class="outline-4">
<h4 id="org5b525b9"><span class="section-number-4">4.11.2</span> usage</h4>
<div class="outline-text-4" id="text-4-11-2">
<div class="org-src-container">
<pre class="src src-lisp">(euclidean-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 14.387494569938159</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org64fcaba" class="outline-3">
<h3 id="org64fcaba"><span class="section-number-3">4.12</span> チェビシェフ距離</h3>
<div class="outline-text-3" id="text-4-12">
</div>
<div id="outline-container-orgabb49de" class="outline-4">
<h4 id="orgabb49de"><span class="section-number-4">4.12.1</span> definition</h4>
<div class="outline-text-4" id="text-4-12-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org14aaa19">(<span class="org-keyword">defun</span> <span class="org-function-name">chebyshev-distance</span> (lst)
  (reduce #'max (mapcar #'abs lst)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf506cbf" class="outline-4">
<h4 id="orgf506cbf"><span class="section-number-4">4.12.2</span> usage</h4>
<div class="outline-text-4" id="text-4-12-2">
<div class="org-src-container">
<pre class="src src-lisp">(chebyshev-distance '(3 -1 -4 1 -5 9 2 -6 5 -3)) <span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 9</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: takeounn</p>
<p class="date">Created: 2020-11-07 Sat 01:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
